In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame( {"Roll_No":[23,16,45,32,56,44,21,22,45,12,29,10,31,42,33],"Name":
                ["rahul","riya","arav","balaji","ram","arjun","data","golu","bittu","adi","anshu","switi","rahul","avi","ravi"], "Division":
                ["A","C","F","B","E","A","B","C","D","B","A","C","E","B","A"], "Marks":
                [87,56,45,77,48,90,76,45,82,56,78,65,49,80,97] ,"Branch":["CSE","ENTC","AIML","DS","CIVIL","MECH","CHEMI","ELEC","CYBER","CSE","CSE","DS","CSE","DS","CSE"]})
                                               
print(df)

    Roll_No    Name Division  Marks Branch
0        23   rahul        A     87    CSE
1        16    riya        C     56   ENTC
2        45    arav        F     45   AIML
3        32  balaji        B     77     DS
4        56     ram        E     48  CIVIL
5        44   arjun        A     90   MECH
6        21    data        B     76  CHEMI
7        22    golu        C     45   ELEC
8        45   bittu        D     82  CYBER
9        12     adi        B     56    CSE
10       29   anshu        A     78    CSE
11       10   switi        C     65     DS
12       31   rahul        E     49    CSE
13       42     avi        B     80     DS
14       33    ravi        A     97    CSE

In [4]:
# apply sum() function to whole dataset
df.sum()

Roll_No                                                   461
Name        rahulriyaaravbalajiramarjundatagolubittuadians...
Division                                      ACFBEABCDBACEBA
Marks                                                    1031
Branch      CSEENTCAIMLDSCIVILMECHCHEMIELECCYBERCSECSEDSCS...
dtype: object

In [5]:
# apply min() function to whole dataset
df.min()

Roll_No       10
Name         adi
Division       A
Marks         45
Branch      AIML
dtype: object

In [6]:
# apply max() function to whole dataset
df.max()

Roll_No        56
Name        switi
Division        F
Marks          97
Branch       MECH
dtype: object

In [7]:
# apply len() function to whole dataset
len(df)

15

In [8]:
# apply count() function to whole dataset
df.count()

Roll_No     15
Name        15
Division    15
Marks       15
Branch      15
dtype: int64

In [13]:
# apply aggregate function to specific column sum function is just work numeric value
d=df["Roll_No"].sum()
print(d)
d1=df["Marks"].sum()
print("total print: ",d1)

461
total print:  1031

In [15]:
d=df["Roll_No"].min()
d1=df["Roll_No"].max()
d2=df["Marks"].min()
d3=df["Marks"].max()
d4=df["Marks"].mean()
d5=df["Name"].count()
print("Min roll no.:",d)
print("Max roll no.:",d1)
print("Min mark:",d2)
print("Max mark:",d3)
print("Mean of mark:",d4)
print("total counts of name:",d5)

Min roll no.: 10
Max roll no.: 56
Min mark: 45
Max mark: 97
Mean of mark: 68.73333333333333
total counts of name: 15

In [25]:
df=df.rename(columns={"Marks":"MSE_Mark"})
df

    Roll_No    Name Division  MSE_Mark Branch
0        23   rahul        A        87    CSE
1        16    riya        C        56   ENTC
2        45    arav        F        45   AIML
3        32  balaji        B        77     DS
4        56     ram        E        48  CIVIL
5        44   arjun        A        90   MECH
6        21    data        B        76  CHEMI
7        22    golu        C        45   ELEC
8        45   bittu        D        82  CYBER
9        12     adi        B        56    CSE
10       29   anshu        A        78    CSE
11       10   switi        C        65     DS
12       31   rahul        E        49    CSE
13       42     avi        B        80     DS
14       33    ravi        A        97    CSE

In [27]:
df["MSE_Mark"]=[13,23,21,22,14,25,12,19,20,27,19,22,13,14,21]
df

    Roll_No    Name Division  MSE_Mark Branch
0        23   rahul        A        13    CSE
1        16    riya        C        23   ENTC
2        45    arav        F        21   AIML
3        32  balaji        B        22     DS
4        56     ram        E        14  CIVIL
5        44   arjun        A        25   MECH
6        21    data        B        12  CHEMI
7        22    golu        C        19   ELEC
8        45   bittu        D        20  CYBER
9        12     adi        B        27    CSE
10       29   anshu        A        19    CSE
11       10   switi        C        22     DS
12       31   rahul        E        13    CSE
13       42     avi        B        14     DS
14       33    ravi        A        21    CSE